package com.javarush.test.level03.lesson04.task01;

/* Дата рождения
Вывести на экран дату своего рождения в виде: MAY 1 2012
*/

public class Solution
{
    public static void main(String[] args)
    {
        //напишите тут ваш код
        System.out.print("AUGUST 31 1986");
    }
}